app/controllers/api/boards_controller.rb

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @board = Board.find_by_id(params[:id])

INSERT INTO "boards" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Third board"], ["created_at", "2019-10-28 09:07:27.696860"], ["updated_at", "2019-10-28 09:07:27.696860"]]
---
  def create
    @board = Board.new(board_params)

    if @board.save