app/controllers/api/cards_controller.rb

	def create
		new_card = card_params[:card].merge({ list_id: card_params[:list_id]})
		@card = Card.new(new_card)

		if !@card.save
---
INSERT INTO "cards" ("title", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Another card"], ["list_id", 1], ["created_at", "2020-10-09 17:43:31.159040"], ["updated_at", "2020-10-09 17:43:31.159040"]]

	def show
    @card = Card.find_by_id(params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]