app/controllers/api/lists_controller.rb

  def create
    @list = List.new(list_params)

    if @list.save
---
INSERT INTO "lists" ("title", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Sample Title"], ["board_id", 1], ["created_at", "2020-10-09 15:25:32.590641"], ["updated_at", "2020-10-09 15:25:32.590641"]]

  def update
    @list = List.find_by_id(params[:id])

    render :json => { :error => 'not found' }, :status => 404 if @list.nil?

    if !@list.update(title: params[:title])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "lists" SET "title" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["title", "Third List 4"], ["updated_at", "2020-10-09 16:00:45.847368"], ["id", 5]]